[
    {
        "year": 0,
        "data": [
            {
                "title": "Tutorial",
                "location": {
                    "lat": 40,
                    "lng": -75,
                    "altitude": 2.5
                },
                "html": "This is the world in 2021. Feel free to explore: drag the globe around, zoom in and out by scrolling in/out (or touchpad gestures). When you're ready to start our time-travel journey, press the button in the lower right. *Also, this site is a little computationally-intensive, so if the site ever freezes, simply refresh and it should work fine*"
            }
        ]
    },
    {
        "year": 1000,
        "data": [
            {
                "title": "Overview",
                "location": {
                    "lat": 0,
                    "lng": 0,
                    "altitude": 2.5
                },
                "html": "Welcome to the year 1000! At this point, there are roughly 300 million people on the planet, and empires are popping up left and right! Let's see what's going on in each region of the world!"
            },
            {
                "title": "Europe",
                "location": {
                    "lat": 47,
                    "lng": 7,
                    "altitude": 1
                },
                "html": "Here in Europe, things are a little crazy (as they are in basically every point in history). The Byzantine Empire is the major player in the region, Feudalism is in full swing, and northern Europe is still reeling from Viking raids. Watch out for the Christian schism and the Crusades coming up! Meanwhile, the Umayyads provided a Muslim presence in Spain, which was called <i>al-Andalus</i>."
            },
            {
                "title": "Middle East",
                "location": {
                    "lat": 30,
                    "lng": 50,
                    "altitude": 1
                },
                "html": "Speaking of Islam, Muslims took hold of the Middle East, and Shia-Sunni conflicts had been raging for a few hundred years at this point. This map shows the region as split into many different caliphates, but the Abbasids take complete control over the region not long after 1000. "
            },
            {
                "title": "Asia",
                "location": {
                    "lat": 30,
                    "lng": 115,
                    "altitude": 1
                },
                "html": "Moving on to Asia, the Song dynasty, the second Chinese dynasty, is in power. China saw a very successful period under the Song, with printing processes allowing literature to spread. The Song ruled with neo-Confucianism and held civil service in high regard. In Japan, Buddhism and Shintoism supplanted themselves as the primary religions. In India and Southeast Asia, Hinduism was the primary religion, with Buddhist influence, and trade was the primary economic focus of these states. <p> <span style=\"font-size: 0.5rem\"> ALSO... THE MONGOLS ARE COMING!! </span></p>"
            },
            {
                "title": "Africa",
                "location": {
                    "lat": 0,
                    "lng": 20,
                    "altitude": 2.5
                },
                "html": "In Africa, Islam spread from the Mediterranean and the trans-Saharan trade routes, as well as through the Indian Ocean trade routes in Swahili Coast, but local tribal faiths remained somewhat intact for much of the continent, and fledgling empires such as Mali began to appear. "
            },
            {
                "title": "America",
                "location": {
                    "lat": -10,
                    "lng": -75,
                    "altitude": 2
                },
                "html": "On the other side of the world, in the Americas, Native American groups are all over North America, and the beginnings of Mesoamerican empires are in place."
            }
        ]
    },
    {
        "year": 1279,
        "data": [
            {
                "title": "Overview",
                "location": {
                    "lat": 0,
                    "lng": 0,
                    "altitude": 2.5
                },
                "html": "Now, we're at the year 1279! Let's take a look around."
            },
            {
                "title": "Europe",
                "location": {
                    "lat": 47,
                    "lng": 7,
                    "altitude": 1
                },
                "html": "Feudalism still exists here in Europe, but nation-states are growing in power. The Magna Carta was signed in England, and the Spanish drove out the Muslims (although the worst is still yet to come...). The Byzantine Empire is still strong, although those Turks seem to be a little intimidating..."
            },
            {
                "title": "Asia",
                "location": {
                    "lat": 30,
                    "lng": 100,
                    "altitude": 1
                },
                "html": "And here it is: the Mongols. They took <b><i>everything.</b></i>. From horse-riding nomads to rulers of Asia and the Middle East... that Genghis Khan dude was crazy (successful)! The Chagatai, Golden Horde, Ilkhanate, and the Yuan Dynasty in China were all Mongol controlled-areas. Just mindblowing stuff... Still, they brought a lot of trade across their empire, even though a lot more was being exchanged than just goods (*cough, cough* The Black Death)!"
            },
            {
                "title": "Middle East",
                "location": {
                    "lat": 30,
                    "lng": 50,
                    "altitude": 1
                },
                "html": "After the Abbasid Empire had its <i>Pax Islamica</i>, the Abbasids finally fell last year and those pesky Mongols took control of the Middle East! All this in the middle of the Crusades and other intra-Muslim conflicts! The nerve!"
            },
            {
                "title": "Africa",
                "location": {
                    "lat": 0,
                    "lng": 20,
                    "altitude": 2.5
                },
                "html": "In Africa, Islam continued to spread from the Mediterranean and the trans-Saharan trade routes, as well as through the Indian Ocean trade routes in Swahili Coast. Mali continued to grow in strength as well, and apparently this guy named Mansa Musa is betting big on the gold trade there, hope it works out for him!"
            },
            {
                "title": "America",
                "location": {
                    "lat": -10,
                    "lng": -75,
                    "altitude": 2
                },
                "html": "Again, the fledgling empires in Central America and the Andes are continuing to grow, as they are slowly coming up on the peak of their civilizations. The Mayans establish themselves in the Yucatan."
            }
        ]
    },
    {
        "year": 1492,
        "data": [
            {
                "title": "",
                "location": {
                    "lat": 0,
                    "lng": 0,
                    "altitude": 2.5
                },
                "html": "This is html!"
            },
            {
                "title": "",
                "location": {
                    "lat": 0,
                    "lng": 0,
                    "altitude": 2.5
                },
                "html": ""
            }
        ]
    },
    {
        "year": 1650,
        "data": [
            {
                "title": "",
                "location": {
                    "lat": 0,
                    "lng": 0,
                    "altitude": 2.5
                },
                "html": "This is html!"
            },
            {
                "title": "",
                "location": {
                    "lat": 0,
                    "lng": 0,
                    "altitude": 2.5
                },
                "html": ""
            }
        ]
    },
    {
        "year": 1783,
        "data": [
            {
                "title": "",
                "location": {
                    "lat": 0,
                    "lng": 0,
                    "altitude": 2.5
                },
                "html": "This is html!"
            },
            {
                "title": "",
                "location": {
                    "lat": 0,
                    "lng": 0,
                    "altitude": 2.5
                },
                "html": ""
            }
        ]
    },
    {
        "year": 1880,
        "data": [
            {
                "title": "",
                "location": {
                    "lat": 0,
                    "lng": 0,
                    "altitude": 2.5
                },
                "html": "This is html!"
            },
            {
                "title": "",
                "location": {
                    "lat": 0,
                    "lng": 0,
                    "altitude": 2.5
                },
                "html": ""
            }
        ]
    },
    {
        "year": 1920,
        "data": [
            {
                "title": "",
                "location": {
                    "lat": 0,
                    "lng": 0,
                    "altitude": 2.5
                },
                "html": "This is html!"
            },
            {
                "title": "",
                "location": {
                    "lat": 0,
                    "lng": 0,
                    "altitude": 2.5
                },
                "html": ""
            }
        ]
    },
    {
        "year": 1945,
        "data": [
            {
                "title": "",
                "location": {
                    "lat": 0,
                    "lng": 0,
                    "altitude": 2.5
                },
                "html": "This is html!"
            },
            {
                "title": "",
                "location": {
                    "lat": 0,
                    "lng": 0,
                    "altitude": 2.5
                },
                "html": ""
            }
        ]
    },
    {
        "year": 2021,
        "data": [
            {
                "title": "",
                "location": {
                    "lat": 0,
                    "lng": 0,
                    "altitude": 2.5
                },
                "html": "This is html!"
            },
            {
                "title": "",
                "location": {
                    "lat": 0,
                    "lng": 0,
                    "altitude": 2.5
                },
                "html": ""
            }
        ]
    }
]