[
    {
        "year": 0,
        "data": [
            {
                "title": "Tutorial",
                "location": {
                    "lat": 40,
                    "lng": -75,
                    "altitude": 2.5
                },
                "html": "This is the world in 2021. Feel free to explore: drag the globe around, zoom in and out by scrolling in/out (or touchpad gestures). When you're ready to start our time-travel journey, press the button in the lower right. *Also, this site is a little computationally-intensive, so if the site ever freezes, simply refresh and it should work fine*"
            }
        ]
    },
    {
        "year": 1000,
        "data": [
            {
                "title": "Overview",
                "location": {
                    "lat": 0,
                    "lng": 0,
                    "altitude": 2.5
                },
                "html": "Welcome to the year 1000! At this point, there are roughly 300 million people on the planet, and empires are popping up left and right! Let's see what's going on in each region of the world!"
            },
            {
                "title": "Europe",
                "location": {
                    "lat": 47,
                    "lng": 7,
                    "altitude": 1
                },
                "html": "Here in Europe, things are a little crazy (as they are in basically every point in history). The Byzantine Empire is the major player in the region, Feudalism is in full swing, and northern Europe is still reeling from Viking raids. Watch out for the Christian schism and the Crusades coming up! Meanwhile, the Umayyads provided a Muslim presence in Spain, which was called <i>al-Andalus</i>."
            },
            {
                "title": "Middle East",
                "location": {
                    "lat": 30,
                    "lng": 50,
                    "altitude": 1
                },
                "html": "Speaking of Islam, Muslims took hold of the Middle East, and Shia-Sunni conflicts had been raging for a few hundred years at this point. This map shows the region as split into many different caliphates, but the Abbasids take complete control over the region not long after 1000. "
            },
            {
                "title": "Asia",
                "location": {
                    "lat": 30,
                    "lng": 115,
                    "altitude": 1
                },
                "html": "Moving on to Asia, where the Song dynasty is in power. China saw a very successful period under the Song, with printing processes allowing literature to spread and a stable government promoting peace. The Song ruled with neo-Confucianism and held civil service in high regard. In Japan, Buddhism and Shintoism supplanted themselves as the primary religions. In India and Southeast Asia, Hinduism was the primary religion, with Buddhist influence, and trade was the primary economic focus of these states. <p> <span style=\"font-size: 0.5rem\"> ALSO... THE MONGOLS ARE COMING!! </span></p>"
            },
            {
                "title": "Africa",
                "location": {
                    "lat": 0,
                    "lng": 20,
                    "altitude": 2.5
                },
                "html": "In Africa, Islam spread from the Mediterranean and the trans-Saharan trade routes, as well as through the Indian Ocean trade routes in Swahili Coast, but local tribal faiths remained somewhat intact for much of the continent, and fledgling empires such as Mali began to appear. "
            },
            {
                "title": "America",
                "location": {
                    "lat": 0,
                    "lng": -75,
                    "altitude": 2
                },
                "html": "On the other side of the world, in the Americas, Native American groups are all over North America, and the beginnings of Mesoamerican empires are taking shape."
            }
        ]
    },
    {
        "year": 1279,
        "data": [
            {
                "title": "Overview",
                "location": {
                    "lat": 0,
                    "lng": 0,
                    "altitude": 2.5
                },
                "html": "Now, we're at the year 1279! Let's take a look around."
            },
            {
                "title": "Europe",
                "location": {
                    "lat": 47,
                    "lng": 7,
                    "altitude": 1
                },
                "html": "Feudalism still exists here in Europe, but nation-states are growing in power. The Magna Carta was signed in England, and the Spanish drove out the Muslims (although the worst is still yet to come...). The Byzantine Empire is still strong, although those Turks seem to be a little intimidating..."
            },
            {
                "title": "Asia",
                "location": {
                    "lat": 30,
                    "lng": 100,
                    "altitude": 1
                },
                "html": "And here it is: the Mongols. They took <b><i>everything.</b></i>. From horse-riding nomads to rulers of Asia and the Middle East... that Genghis Khan dude was crazy (successful)! The Chagatai, Golden Horde, Ilkhanate, and the Yuan Dynasty in China were all Mongol controlled-areas. Just mindblowing stuff... Still, they brought a lot of trade across their empire, even though a lot more was being exchanged than just goods (*cough, cough* The Black Death)!"
            },
            {
                "title": "Middle East",
                "location": {
                    "lat": 30,
                    "lng": 50,
                    "altitude": 1
                },
                "html": "After the Abbasid Empire had its <i>Pax Islamica</i>, the Abbasids finally fell last year and those pesky Mongols took control of the Middle East! All this in the middle of the Crusades and other intra-Muslim conflicts! The nerve!"
            },
            {
                "title": "Africa",
                "location": {
                    "lat": 0,
                    "lng": 20,
                    "altitude": 2.5
                },
                "html": "In Africa, Islam continued to spread from the Mediterranean and the trans-Saharan trade routes, as well as through the Indian Ocean trade routes in Swahili Coast. Mali continued to grow in strength as well, and apparently this guy named Mansa Musa is betting big on the gold trade there, hope it works out for him!"
            },
            {
                "title": "America",
                "location": {
                    "lat": 0,
                    "lng": -75,
                    "altitude": 2
                },
                "html": "Again, the fledgling empires in Central America and the Andes are continuing to grow, as they are slowly coming up on the peak of their civilizations. The Mayans establish themselves in the Yucatan."
            }
        ]
    },
    {
        "year": 1492,
        "data": [
            {
                "title": "Overview",
                "location": {
                    "lat": 0,
                    "lng": 0,
                    "altitude": 2.5
                },
                "html": "<i>In 1492, Columbus sailed the ocean blue</i> is what we were taught as kids, but there was a lot more going on in the world at this time too, let's check it out. "
            },
            {
                "title": "Europe",
                "location": {
                    "lat": 47,
                    "lng": 7,
                    "altitude": 1
                },
                "html": "In this period, nation-states have become even stronger. Not much has changed in Western Europe, although the Spanish had an inquisition that seemed pretty intense. the Hundred Years' War just wrapped up, but I doubt England and France will stop fighting anytime soon. Eastern Europe is much more interesting at this point, with the Russians establishing themselves in Moscow, and wait... what happened to the Byzantine Empire?"
            },
            {
                "title": "Middle East",
                "location": {
                    "lat": 30,
                    "lng": 50,
                    "altitude": 1
                },
                "html": "Yep, just what I expected. It was those Turks I was telling you about earlier! The Ottoman Turks took over Constantinople and made it the capital of the Ottoman Empire. The Turks have also gained power throughout the rest of the Middle East as well."
            },
            {
                "title": "Asia",
                "location": {
                    "lat": 30,
                    "lng": 100,
                    "altitude": 1
                },
                "html": "Finally, the Chinese were able to re-establish Chinese rule of China with the Ming dynasty! The Ming strengthened the tribute system to enforce their influence over SE Asia. Meanwhile, in India, political power is still somewhat decentralized, but Muslims are gaining power in the North, while Hindu trade-based societies still have control of the South."
            },
            {
                "title": "Africa",
                "location": {
                    "lat": 0,
                    "lng": 20,
                    "altitude": 2.5
                },
                "html": "In Africa, the Songhai grew in power, challenging the Mali over trans-Saharan trade dominance and growing wealthy themselves. Oh, and that Mansa Musa guy? He ended up being one of the richest men in history! I should've invested in gold instead of that Champacoin BS those Silk Road traders got me into... Anyways, speaking of money, the Eastern African trade states are still raking in profits from the Indian Ocean trade, especially as their technology gets better."
            },
            {
                "title": "America",
                "location": {
                    "lat": 0,
                    "lng": -75,
                    "altitude": 2
                },
                "html": "The height of Mesoamerica, right before the Europeans show up. Everything is fabulous: the Maya, Aztec, and Inca are all thriving, managing large empires and sustaining advanced civilizations. I mean, Machu Picchu is amazing, and the Aztecs and Mayans built several large pyramids themselves as well. Real geniuses, they were, even though the Aztecs were a little brutal with their flower wars and humans sacrifices... a small price to pay for advanced calendars, I guess. "
            }
        ]
    },
    {
        "year": 1650,
        "data": [
            {
                "title": "Overview",
                "location": {
                    "lat": 0,
                    "lng": 0,
                    "altitude": 2.5
                },
                "html": "Welcome to 1650! A lot has changed in the 150 years or so we skipped over, so let's hop right in!"
            },
            {
                "title": "Europe",
                "location": {
                    "lat": 47,
                    "lng": 7,
                    "altitude": 1
                },
                "html": "The pattern of nation-states growing stronger continued into this period, and the Ottoman Empire's expansion begins to threaten the rest of Europe. However, Europe's biggest influence on this period is what happened throughout the rest of the world..."
            },
            {
                "title": "Middle East",
                "location": {
                    "lat": 30,
                    "lng": 50,
                    "altitude": 1
                },
                "html": "Like I just mentioned, the Ottomans are growing to take over much of the Middle East, while the Safavid and Mughal Empires (the three collectively known as the Gunpowder Empires) are all jostling for control in the region."
            },
            {
                "title": "Asia",
                "location": {
                    "lat": 30,
                    "lng": 100,
                    "altitude": 1
                },
                "html": "Just as the Chinese regained native control of China, the Manchus (from Manchuria, known for their <a style='color: #fff' href='https://i.pinimg.com/originals/3a/81/1e/3a811eaf9de776f6c9abb6fa2dae3881.jpg'>hair</a>). Meanwhile, the remnants of the Mongol Empire are still present in Central Asia, while the Mughal Empire (Muslims) are in control of much of India. Look for political and religious tensions to allow the British to leech some power in the region! Wait, and the Indonesian islands are now... the Dutch East Indies?? These Europeans have one taste of nutmeg and they go conquering foreign lands for it, they never learn..."
            },
            {
                "title": "America",
                "location": {
                    "lat": 0,
                    "lng": -75,
                    "altitude": 2
                },
                "html": "What a grotesque downfall. All it took was a few Europeans and their nasty germs to wipe out some of the greatest empires the world has ever seen. And now what is this? Nearly every European nation wants a piece of the Americas, and the Spanish got most of it! And in traditional Spanish fashion, they establish a strict racial code and an economic system that favors the rich whites... how tragic. Oh, and there's a few American colonies now, but it's still the Wild Wild East out there."
            },
            {
                "title": "Africa",
                "location": {
                    "lat": 0,
                    "lng": 20,
                    "altitude": 2.5
                },
                "html": "Luckily, Africa is safe... for now. Regional mini-empires are sprouting all over the continent, indicating progress!"
            }
        ]
    },
    {
        "year": 1783,
        "data": [
            {
                "title": "",
                "location": {
                    "lat": 0,
                    "lng": 0,
                    "altitude": 2.5
                },
                "html": "This is html!"
            },
            {
                "title": "",
                "location": {
                    "lat": 0,
                    "lng": 0,
                    "altitude": 2.5
                },
                "html": ""
            }
        ]
    },
    {
        "year": 1880,
        "data": [
            {
                "title": "",
                "location": {
                    "lat": 0,
                    "lng": 0,
                    "altitude": 2.5
                },
                "html": "This is html!"
            },
            {
                "title": "",
                "location": {
                    "lat": 0,
                    "lng": 0,
                    "altitude": 2.5
                },
                "html": ""
            }
        ]
    },
    {
        "year": 1920,
        "data": [
            {
                "title": "",
                "location": {
                    "lat": 0,
                    "lng": 0,
                    "altitude": 2.5
                },
                "html": "This is html!"
            },
            {
                "title": "",
                "location": {
                    "lat": 0,
                    "lng": 0,
                    "altitude": 2.5
                },
                "html": ""
            }
        ]
    },
    {
        "year": 1945,
        "data": [
            {
                "title": "",
                "location": {
                    "lat": 0,
                    "lng": 0,
                    "altitude": 2.5
                },
                "html": "This is html!"
            },
            {
                "title": "",
                "location": {
                    "lat": 0,
                    "lng": 0,
                    "altitude": 2.5
                },
                "html": ""
            }
        ]
    },
    {
        "year": 2021,
        "data": [
            {
                "title": "",
                "location": {
                    "lat": 0,
                    "lng": 0,
                    "altitude": 2.5
                },
                "html": "This is html!"
            },
            {
                "title": "",
                "location": {
                    "lat": 0,
                    "lng": 0,
                    "altitude": 2.5
                },
                "html": ""
            }
        ]
    }
]